IFPM/OF_Model/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/col_model.fms";

minCellSize 0.25;

maxCellSize 0.25;

boundaryCellSize 0.25;

/*localRefinement
{
    "ringArea.*"
    {
        cellSize 0.2;
    }
}*/

/*boundaryLayers
{
    nLayers 5;

    thicknessRatio 1.1;

    maxFirstLayerThickness 0.5;

}*/


// ************************************************************************* //
