IFPM/OF_Model/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet.stl
    {
        // type            fixedValue;
        // value uniform   0;
        type            zeroGradient;
    }

    outlet.stl
    {
        type            fixedValue;
        value uniform   0;
        // type            zeroGradient;
    }

    wall_up.stl
    {
        type            zeroGradient;
    }

    wall_down.stl
    {
        type            zeroGradient;
    }

    cover_up.stl
    {
        type            empty;
    }   

    cover_down.stl
    {
        type            empty;
    }

    grain_4_2.stl
    {
        type            zeroGradient;
    }
    grain_4_6.stl
    {
        type            zeroGradient;
    }
    grain_4_17.stl
    {
        type            zeroGradient;
    }
    grain_4_18.stl
    {
        type            zeroGradient;
    }
    grain_4_22.stl
    {
        type            zeroGradient;
    }
    grain_4_26.stl
    {
        type            zeroGradient;
    }
    grain_4_39.stl
    {
        type            zeroGradient;
    }
    grain_4_45.stl
    {
        type            zeroGradient;
    }
    grain_5_15.stl
    {
        type            zeroGradient;
    }
    grain_5_50.stl
    {
        type            zeroGradient;
    }
    grain_5_54.stl
    {
        type            zeroGradient;
    }
    grain_5_60.stl
    {
        type            zeroGradient;
    }
    grain_6_18.stl
    {
        type            zeroGradient;
    }
    grain_6_27.stl
    {
        type            zeroGradient;
    }
    grain_6_28.stl
    {
        type            zeroGradient;
    }
    grain_6_45.stl
    {
        type            zeroGradient;
    }
    grain_7_1.stl
    {
        type            zeroGradient;
    }
    grain_7_14.stl
    {
        type            zeroGradient;
    }
    grain_8_5.stl
    {
        type            zeroGradient;
    }
    grain_8_16.stl
    {
        type            zeroGradient;
    }
    grain_8_24.stl
    {
        type            zeroGradient;
    }
    grain_8_42.stl
    {
        type            zeroGradient;
    }
    grain_8_44.stl
    {
        type            zeroGradient;
    }
    grain_8_45.stl
    {
        type            zeroGradient;
    }
    grain_8_46.stl
    {
        type            zeroGradient;
    }
    grain_8_56.stl
    {
        type            zeroGradient;
    }
    grain_8_63.stl
    {
        type            zeroGradient;
    }
    grain_9_3.stl
    {
        type            zeroGradient;
    }
    grain_9_7.stl
    {
        type            zeroGradient;
    }
    grain_9_11.stl
    {
        type            zeroGradient;
    }
    grain_9_34.stl
    {
        type            zeroGradient;
    }
    grain_9_37.stl
    {
        type            zeroGradient;
    }
    grain_9_41.stl
    {
        type            zeroGradient;
    }
    grain_9_46.stl
    {
        type            zeroGradient;
    }
    grain_9_47.stl
    {
        type            zeroGradient;
    }
    grain_9_49.stl
    {
        type            zeroGradient;
    }
    grain_10_9.stl
    {
        type            zeroGradient;
    }
    grain_10_17.stl
    {
        type            zeroGradient;
    }
    grain_10_21.stl
    {
        type            zeroGradient;
    }
    grain_10_58.stl
    {
        type            zeroGradient;
    }
    grain_11_7.stl
    {
        type            zeroGradient;
    }
    grain_11_24.stl
    {
        type            zeroGradient;
    }
    grain_11_27.stl
    {
        type            zeroGradient;
    }
    grain_11_31.stl
    {
        type            zeroGradient;
    }
    grain_11_34.stl
    {
        type            zeroGradient;
    }
    grain_11_47.stl
    {
        type            zeroGradient;
    }
    grain_11_62.stl
    {
        type            zeroGradient;
    }
    grain_12_15.stl
    {
        type            zeroGradient;
    }
    grain_12_16.stl
    {
        type            zeroGradient;
    }
    grain_12_35.stl
    {
        type            zeroGradient;
    }
    grain_12_45.stl
    {
        type            zeroGradient;
    }
    grain_12_53.stl
    {
        type            zeroGradient;
    }
    grain_12_60.stl
    {
        type            zeroGradient;
    }
    grain_13_1.stl
    {
        type            zeroGradient;
    }
    grain_13_4.stl
    {
        type            zeroGradient;
    }
    grain_13_23.stl
    {
        type            zeroGradient;
    }
    grain_13_43.stl
    {
        type            zeroGradient;
    }
    grain_13_46.stl
    {
        type            zeroGradient;
    }
    grain_13_59.stl
    {
        type            zeroGradient;
    }
    grain_13_62.stl
    {
        type            zeroGradient;
    }
    grain_14_6.stl
    {
        type            zeroGradient;
    }
    grain_14_11.stl
    {
        type            zeroGradient;
    }
    grain_14_21.stl
    {
        type            zeroGradient;
    }
    grain_14_29.stl
    {
        type            zeroGradient;
    }
    grain_14_33.stl
    {
        type            zeroGradient;
    }
    grain_14_55.stl
    {
        type            zeroGradient;
    }
    grain_14_63.stl
    {
        type            zeroGradient;
    }
    grain_15_8.stl
    {
        type            zeroGradient;
    }
    grain_15_15.stl
    {
        type            zeroGradient;
    }
    grain_15_16.stl
    {
        type            zeroGradient;
    }
    grain_15_17.stl
    {
        type            zeroGradient;
    }
    grain_15_27.stl
    {
        type            zeroGradient;
    }
    grain_15_47.stl
    {
        type            zeroGradient;
    }
    grain_15_54.stl
    {
        type            zeroGradient;
    }
    grain_16_10.stl
    {
        type            zeroGradient;
    }
    grain_16_11.stl
    {
        type            zeroGradient;
    }
    grain_16_12.stl
    {
        type            zeroGradient;
    }
    grain_16_38.stl
    {
        type            zeroGradient;
    }
    grain_16_44.stl
    {
        type            zeroGradient;
    }
    grain_16_47.stl
    {
        type            zeroGradient;
    }
    grain_16_48.stl
    {
        type            zeroGradient;
    }
    grain_16_57.stl
    {
        type            zeroGradient;
    }
    grain_17_4.stl
    {
        type            zeroGradient;
    }
    grain_17_12.stl
    {
        type            zeroGradient;
    }
    grain_17_18.stl
    {
        type            zeroGradient;
    }
    grain_17_32.stl
    {
        type            zeroGradient;
    }
    grain_18_12.stl
    {
        type            zeroGradient;
    }
    grain_18_50.stl
    {
        type            zeroGradient;
    }
    grain_18_62.stl
    {
        type            zeroGradient;
    }
    grain_19_2.stl
    {
        type            zeroGradient;
    }
    grain_19_5.stl
    {
        type            zeroGradient;
    }
    grain_19_16.stl
    {
        type            zeroGradient;
    }
    grain_19_21.stl
    {
        type            zeroGradient;
    }
    grain_19_36.stl
    {
        type            zeroGradient;
    }
    grain_20_7.stl
    {
        type            zeroGradient;
    }
    grain_20_10.stl
    {
        type            zeroGradient;
    }
    grain_20_18.stl
    {
        type            zeroGradient;
    }
    grain_20_39.stl
    {
        type            zeroGradient;
    }
    grain_20_44.stl
    {
        type            zeroGradient;
    }
    grain_20_51.stl
    {
        type            zeroGradient;
    }
    grain_21_10.stl
    {
        type            zeroGradient;
    }
    grain_21_25.stl
    {
        type            zeroGradient;
    }
    grain_21_32.stl
    {
        type            zeroGradient;
    }
    grain_21_37.stl
    {
        type            zeroGradient;
    }
    grain_21_39.stl
    {
        type            zeroGradient;
    }
    grain_21_53.stl
    {
        type            zeroGradient;
    }
    grain_22_8.stl
    {
        type            zeroGradient;
    }
    grain_22_27.stl
    {
        type            zeroGradient;
    }
    grain_22_32.stl
    {
        type            zeroGradient;
    }
    grain_22_43.stl
    {
        type            zeroGradient;
    }
    grain_22_44.stl
    {
        type            zeroGradient;
    }
    grain_22_46.stl
    {
        type            zeroGradient;
    }
    grain_22_54.stl
    {
        type            zeroGradient;
    }
    grain_22_62.stl
    {
        type            zeroGradient;
    }
    grain_23_17.stl
    {
        type            zeroGradient;
    }
    grain_23_25.stl
    {
        type            zeroGradient;
    }
    grain_23_52.stl
    {
        type            zeroGradient;
    }
    grain_24_10.stl
    {
        type            zeroGradient;
    }
    grain_24_11.stl
    {
        type            zeroGradient;
    }
    grain_24_25.stl
    {
        type            zeroGradient;
    }
    grain_24_26.stl
    {
        type            zeroGradient;
    }
    grain_24_34.stl
    {
        type            zeroGradient;
    }
    grain_24_36.stl
    {
        type            zeroGradient;
    }
    grain_24_37.stl
    {
        type            zeroGradient;
    }
    grain_25_6.stl
    {
        type            zeroGradient;
    }
    grain_25_14.stl
    {
        type            zeroGradient;
    }
    grain_25_25.stl
    {
        type            zeroGradient;
    }
    grain_25_34.stl
    {
        type            zeroGradient;
    }
    grain_25_35.stl
    {
        type            zeroGradient;
    }
    grain_25_60.stl
    {
        type            zeroGradient;
    }
    grain_26_0.stl
    {
        type            zeroGradient;
    }
    grain_26_10.stl
    {
        type            zeroGradient;
    }
    grain_26_26.stl
    {
        type            zeroGradient;
    }
    grain_26_32.stl
    {
        type            zeroGradient;
    }
    grain_26_33.stl
    {
        type            zeroGradient;
    }
    grain_27_1.stl
    {
        type            zeroGradient;
    }
    grain_27_12.stl
    {
        type            zeroGradient;
    }
    grain_27_22.stl
    {
        type            zeroGradient;
    }
    grain_27_23.stl
    {
        type            zeroGradient;
    }
    grain_27_28.stl
    {
        type            zeroGradient;
    }
    grain_27_32.stl
    {
        type            zeroGradient;
    }
    grain_27_34.stl
    {
        type            zeroGradient;
    }
    grain_27_35.stl
    {
        type            zeroGradient;
    }
    grain_27_49.stl
    {
        type            zeroGradient;
    }
    grain_27_52.stl
    {
        type            zeroGradient;
    }
    grain_27_56.stl
    {
        type            zeroGradient;
    }
    grain_28_0.stl
    {
        type            zeroGradient;
    }
    grain_28_8.stl
    {
        type            zeroGradient;
    }
    grain_28_9.stl
    {
        type            zeroGradient;
    }
    grain_28_19.stl
    {
        type            zeroGradient;
    }
    grain_28_21.stl
    {
        type            zeroGradient;
    }
    grain_28_34.stl
    {
        type            zeroGradient;
    }
    grain_28_61.stl
    {
        type            zeroGradient;
    }
    grain_29_7.stl
    {
        type            zeroGradient;
    }
    grain_29_16.stl
    {
        type            zeroGradient;
    }
    grain_29_32.stl
    {
        type            zeroGradient;
    }
    grain_29_34.stl
    {
        type            zeroGradient;
    }
    grain_29_48.stl
    {
        type            zeroGradient;
    }
    grain_29_62.stl
    {
        type            zeroGradient;
    }
    grain_30_16.stl
    {
        type            zeroGradient;
    }
    grain_30_19.stl
    {
        type            zeroGradient;
    }
    grain_30_20.stl
    {
        type            zeroGradient;
    }
    grain_30_21.stl
    {
        type            zeroGradient;
    }
    grain_30_28.stl
    {
        type            zeroGradient;
    }
    grain_30_30.stl
    {
        type            zeroGradient;
    }
    grain_30_44.stl
    {
        type            zeroGradient;
    }
    grain_30_56.stl
    {
        type            zeroGradient;
    }
    grain_30_60.stl
    {
        type            zeroGradient;
    }
    grain_31_7.stl
    {
        type            zeroGradient;
    }
    grain_31_14.stl
    {
        type            zeroGradient;
    }
    grain_31_18.stl
    {
        type            zeroGradient;
    }
    grain_31_25.stl
    {
        type            zeroGradient;
    }
    grain_31_31.stl
    {
        type            zeroGradient;
    }
    grain_31_37.stl
    {
        type            zeroGradient;
    }
    grain_31_41.stl
    {
        type            zeroGradient;
    }
    grain_31_58.stl
    {
        type            zeroGradient;
    }
    grain_31_62.stl
    {
        type            zeroGradient;
    }
    grain_32_0.stl
    {
        type            zeroGradient;
    }
    grain_32_9.stl
    {
        type            zeroGradient;
    }
    grain_32_19.stl
    {
        type            zeroGradient;
    }
    grain_32_33.stl
    {
        type            zeroGradient;
    }
    grain_32_39.stl
    {
        type            zeroGradient;
    }
    grain_32_49.stl
    {
        type            zeroGradient;
    }
    grain_32_53.stl
    {
        type            zeroGradient;
    }
    grain_32_59.stl
    {
        type            zeroGradient;
    }
    grain_33_14.stl
    {
        type            zeroGradient;
    }
    grain_33_18.stl
    {
        type            zeroGradient;
    }
    grain_33_33.stl
    {
        type            zeroGradient;
    }
    grain_33_34.stl
    {
        type            zeroGradient;
    }
    grain_33_50.stl
    {
        type            zeroGradient;
    }
    grain_33_51.stl
    {
        type            zeroGradient;
    }
    grain_33_52.stl
    {
        type            zeroGradient;
    }
    grain_33_53.stl
    {
        type            zeroGradient;
    }
    grain_34_38.stl
    {
        type            zeroGradient;
    }
    grain_34_42.stl
    {
        type            zeroGradient;
    }
    grain_34_47.stl
    {
        type            zeroGradient;
    }
    grain_34_48.stl
    {
        type            zeroGradient;
    }
    grain_35_10.stl
    {
        type            zeroGradient;
    }
    grain_35_40.stl
    {
        type            zeroGradient;
    }
    grain_35_48.stl
    {
        type            zeroGradient;
    }
    grain_36_0.stl
    {
        type            zeroGradient;
    }
    grain_36_12.stl
    {
        type            zeroGradient;
    }
    grain_36_36.stl
    {
        type            zeroGradient;
    }
    grain_36_47.stl
    {
        type            zeroGradient;
    }
    grain_36_48.stl
    {
        type            zeroGradient;
    }
    grain_37_2.stl
    {
        type            zeroGradient;
    }
    grain_37_10.stl
    {
        type            zeroGradient;
    }
    grain_37_29.stl
    {
        type            zeroGradient;
    }
    grain_37_30.stl
    {
        type            zeroGradient;
    }
    grain_37_43.stl
    {
        type            zeroGradient;
    }
    grain_37_47.stl
    {
        type            zeroGradient;
    }
    grain_37_51.stl
    {
        type            zeroGradient;
    }
    grain_37_53.stl
    {
        type            zeroGradient;
    }
    grain_37_60.stl
    {
        type            zeroGradient;
    }
    grain_38_20.stl
    {
        type            zeroGradient;
    }
    grain_38_48.stl
    {
        type            zeroGradient;
    }
    grain_39_20.stl
    {
        type            zeroGradient;
    }
    grain_39_36.stl
    {
        type            zeroGradient;
    }
    grain_39_43.stl
    {
        type            zeroGradient;
    }
    grain_39_49.stl
    {
        type            zeroGradient;
    }
    grain_40_0.stl
    {
        type            zeroGradient;
    }
    grain_40_4.stl
    {
        type            zeroGradient;
    }
    grain_40_20.stl
    {
        type            zeroGradient;
    }
    grain_40_25.stl
    {
        type            zeroGradient;
    }
    grain_40_49.stl
    {
        type            zeroGradient;
    }
    grain_40_61.stl
    {
        type            zeroGradient;
    }
    grain_40_62.stl
    {
        type            zeroGradient;
    }
    grain_41_9.stl
    {
        type            zeroGradient;
    }
    grain_41_12.stl
    {
        type            zeroGradient;
    }
    grain_41_14.stl
    {
        type            zeroGradient;
    }
    grain_41_15.stl
    {
        type            zeroGradient;
    }
    grain_41_46.stl
    {
        type            zeroGradient;
    }
    grain_41_52.stl
    {
        type            zeroGradient;
    }
    grain_41_57.stl
    {
        type            zeroGradient;
    }
    grain_41_59.stl
    {
        type            zeroGradient;
    }
    grain_41_60.stl
    {
        type            zeroGradient;
    }
    grain_41_61.stl
    {
        type            zeroGradient;
    }
    grain_42_18.stl
    {
        type            zeroGradient;
    }
    grain_42_21.stl
    {
        type            zeroGradient;
    }
    grain_42_23.stl
    {
        type            zeroGradient;
    }
    grain_42_38.stl
    {
        type            zeroGradient;
    }
    grain_42_42.stl
    {
        type            zeroGradient;
    }
    grain_42_47.stl
    {
        type            zeroGradient;
    }
    grain_42_54.stl
    {
        type            zeroGradient;
    }
    grain_43_1.stl
    {
        type            zeroGradient;
    }
    grain_43_24.stl
    {
        type            zeroGradient;
    }
    grain_43_25.stl
    {
        type            zeroGradient;
    }
    grain_43_29.stl
    {
        type            zeroGradient;
    }
    grain_43_60.stl
    {
        type            zeroGradient;
    }
    grain_43_63.stl
    {
        type            zeroGradient;
    }
    grain_44_14.stl
    {
        type            zeroGradient;
    }
    grain_44_43.stl
    {
        type            zeroGradient;
    }
    grain_44_51.stl
    {
        type            zeroGradient;
    }
    grain_45_4.stl
    {
        type            zeroGradient;
    }
    grain_45_31.stl
    {
        type            zeroGradient;
    }
    grain_45_58.stl
    {
        type            zeroGradient;
    }
    grain_45_63.stl
    {
        type            zeroGradient;
    }
    grain_46_4.stl
    {
        type            zeroGradient;
    }
    grain_46_12.stl
    {
        type            zeroGradient;
    }
    grain_46_14.stl
    {
        type            zeroGradient;
    }
    grain_46_27.stl
    {
        type            zeroGradient;
    }
    grain_46_51.stl
    {
        type            zeroGradient;
    }
    grain_46_52.stl
    {
        type            zeroGradient;
    }
    grain_46_56.stl
    {
        type            zeroGradient;
    }
    grain_47_10.stl
    {
        type            zeroGradient;
    }
    grain_47_13.stl
    {
        type            zeroGradient;
    }
    grain_47_19.stl
    {
        type            zeroGradient;
    }
    grain_47_26.stl
    {
        type            zeroGradient;
    }
    grain_47_37.stl
    {
        type            zeroGradient;
    }
    grain_47_46.stl
    {
        type            zeroGradient;
    }
    grain_47_53.stl
    {
        type            zeroGradient;
    }
    grain_47_57.stl
    {
        type            zeroGradient;
    }
    grain_47_58.stl
    {
        type            zeroGradient;
    }
    grain_48_1.stl
    {
        type            zeroGradient;
    }
    grain_48_31.stl
    {
        type            zeroGradient;
    }
    grain_48_41.stl
    {
        type            zeroGradient;
    }
    grain_48_44.stl
    {
        type            zeroGradient;
    }
    grain_48_62.stl
    {
        type            zeroGradient;
    }
    grain_49_24.stl
    {
        type            zeroGradient;
    }
    grain_49_27.stl
    {
        type            zeroGradient;
    }
    grain_49_40.stl
    {
        type            zeroGradient;
    }
    grain_49_57.stl
    {
        type            zeroGradient;
    }
    grain_49_59.stl
    {
        type            zeroGradient;
    }
    grain_50_0.stl
    {
        type            zeroGradient;
    }
    grain_50_3.stl
    {
        type            zeroGradient;
    }
    grain_50_19.stl
    {
        type            zeroGradient;
    }
    grain_50_21.stl
    {
        type            zeroGradient;
    }
    grain_50_31.stl
    {
        type            zeroGradient;
    }
    grain_50_34.stl
    {
        type            zeroGradient;
    }
    grain_50_40.stl
    {
        type            zeroGradient;
    }
    grain_50_48.stl
    {
        type            zeroGradient;
    }
    grain_50_50.stl
    {
        type            zeroGradient;
    }
    grain_51_10.stl
    {
        type            zeroGradient;
    }
    grain_51_49.stl
    {
        type            zeroGradient;
    }
    grain_51_52.stl
    {
        type            zeroGradient;
    }
    grain_51_55.stl
    {
        type            zeroGradient;
    }
    grain_52_0.stl
    {
        type            zeroGradient;
    }
    grain_52_6.stl
    {
        type            zeroGradient;
    }
    grain_52_48.stl
    {
        type            zeroGradient;
    }
    grain_53_0.stl
    {
        type            zeroGradient;
    }
    grain_53_17.stl
    {
        type            zeroGradient;
    }
    grain_53_23.stl
    {
        type            zeroGradient;
    }
    grain_53_31.stl
    {
        type            zeroGradient;
    }
    grain_53_33.stl
    {
        type            zeroGradient;
    }
    grain_54_10.stl
    {
        type            zeroGradient;
    }
    grain_54_18.stl
    {
        type            zeroGradient;
    }
    grain_54_23.stl
    {
        type            zeroGradient;
    }
    grain_54_25.stl
    {
        type            zeroGradient;
    }
    grain_54_51.stl
    {
        type            zeroGradient;
    }
    grain_55_17.stl
    {
        type            zeroGradient;
    }
    grain_55_32.stl
    {
        type            zeroGradient;
    }
    grain_55_36.stl
    {
        type            zeroGradient;
    }
    grain_55_46.stl
    {
        type            zeroGradient;
    }
    grain_55_52.stl
    {
        type            zeroGradient;
    }
    grain_55_56.stl
    {
        type            zeroGradient;
    }
    grain_55_61.stl
    {
        type            zeroGradient;
    }
    grain_56_5.stl
    {
        type            zeroGradient;
    }
    grain_56_6.stl
    {
        type            zeroGradient;
    }
    grain_56_29.stl
    {
        type            zeroGradient;
    }
    grain_56_47.stl
    {
        type            zeroGradient;
    }
    grain_57_4.stl
    {
        type            zeroGradient;
    }
    grain_57_12.stl
    {
        type            zeroGradient;
    }
    grain_57_13.stl
    {
        type            zeroGradient;
    }
    grain_57_17.stl
    {
        type            zeroGradient;
    }
    grain_57_31.stl
    {
        type            zeroGradient;
    }
    grain_57_33.stl
    {
        type            zeroGradient;
    }
    grain_57_37.stl
    {
        type            zeroGradient;
    }
    grain_58_3.stl
    {
        type            zeroGradient;
    }
    grain_58_17.stl
    {
        type            zeroGradient;
    }
    grain_58_18.stl
    {
        type            zeroGradient;
    }
    grain_58_19.stl
    {
        type            zeroGradient;
    }
    grain_58_28.stl
    {
        type            zeroGradient;
    }
    grain_58_32.stl
    {
        type            zeroGradient;
    }
    grain_58_46.stl
    {
        type            zeroGradient;
    }
    grain_58_53.stl
    {
        type            zeroGradient;
    }
    grain_58_58.stl
    {
        type            zeroGradient;
    }
    grain_58_61.stl
    {
        type            zeroGradient;
    }
    grain_59_6.stl
    {
        type            zeroGradient;
    }
    grain_59_11.stl
    {
        type            zeroGradient;
    }
    grain_59_31.stl
    {
        type            zeroGradient;
    }
    grain_59_35.stl
    {
        type            zeroGradient;
    }
    grain_59_36.stl
    {
        type            zeroGradient;
    }
    grain_59_46.stl
    {
        type            zeroGradient;
    }
    grain_59_50.stl
    {
        type            zeroGradient;
    }
    grain_59_53.stl
    {
        type            zeroGradient;
    }
    grain_60_6.stl
    {
        type            zeroGradient;
    }
    grain_60_28.stl
    {
        type            zeroGradient;
    }
    grain_60_40.stl
    {
        type            zeroGradient;
    }
    grain_61_7.stl
    {
        type            zeroGradient;
    }
    grain_61_10.stl
    {
        type            zeroGradient;
    }
    grain_61_31.stl
    {
        type            zeroGradient;
    }
    grain_61_33.stl
    {
        type            zeroGradient;
    }
    grain_61_36.stl
    {
        type            zeroGradient;
    }
    grain_61_37.stl
    {
        type            zeroGradient;
    }
    grain_61_50.stl
    {
        type            zeroGradient;
    }
    grain_61_62.stl
    {
        type            zeroGradient;
    }
    grain_62_4.stl
    {
        type            zeroGradient;
    }
    grain_62_7.stl
    {
        type            zeroGradient;
    }
    grain_62_11.stl
    {
        type            zeroGradient;
    }
    grain_62_14.stl
    {
        type            zeroGradient;
    }
    grain_62_50.stl
    {
        type            zeroGradient;
    }
    grain_62_53.stl
    {
        type            zeroGradient;
    }
    grain_62_61.stl
    {
        type            zeroGradient;
    }
    grain_63_13.stl
    {
        type            zeroGradient;
    }
    grain_63_16.stl
    {
        type            zeroGradient;
    }
    grain_63_23.stl
    {
        type            zeroGradient;
    }
    grain_63_26.stl
    {
        type            zeroGradient;
    }
    grain_63_35.stl
    {
        type            zeroGradient;
    }
    grain_63_38.stl
    {
        type            zeroGradient;
    }
    grain_63_39.stl
    {
        type            zeroGradient;
    }
    grain_63_56.stl
    {
        type            zeroGradient;
    }
    grain_63_60.stl
    {
        type            zeroGradient;
    }
    grain_64_10.stl
    {
        type            zeroGradient;
    }
    grain_64_16.stl
    {
        type            zeroGradient;
    }
    grain_64_41.stl
    {
        type            zeroGradient;
    }
    grain_64_44.stl
    {
        type            zeroGradient;
    }
    grain_64_46.stl
    {
        type            zeroGradient;
    }
    grain_64_48.stl
    {
        type            zeroGradient;
    }
    grain_65_3.stl
    {
        type            zeroGradient;
    }
    grain_65_9.stl
    {
        type            zeroGradient;
    }
    grain_65_18.stl
    {
        type            zeroGradient;
    }
    grain_65_24.stl
    {
        type            zeroGradient;
    }
    grain_66_0.stl
    {
        type            zeroGradient;
    }
    grain_66_12.stl
    {
        type            zeroGradient;
    }
    grain_66_20.stl
    {
        type            zeroGradient;
    }
    grain_66_21.stl
    {
        type            zeroGradient;
    }
    grain_66_33.stl
    {
        type            zeroGradient;
    }
    grain_66_41.stl
    {
        type            zeroGradient;
    }
    grain_66_59.stl
    {
        type            zeroGradient;
    }
    grain_66_61.stl
    {
        type            zeroGradient;
    }
    grain_66_63.stl
    {
        type            zeroGradient;
    }
    grain_67_0.stl
    {
        type            zeroGradient;
    }
    grain_67_2.stl
    {
        type            zeroGradient;
    }
    grain_67_6.stl
    {
        type            zeroGradient;
    }
    grain_67_7.stl
    {
        type            zeroGradient;
    }
    grain_67_8.stl
    {
        type            zeroGradient;
    }
    grain_67_13.stl
    {
        type            zeroGradient;
    }
    grain_67_19.stl
    {
        type            zeroGradient;
    }
    grain_67_39.stl
    {
        type            zeroGradient;
    }
    grain_67_41.stl
    {
        type            zeroGradient;
    }
    grain_67_51.stl
    {
        type            zeroGradient;
    }
    }